.config/emacs/init.org
#+TITLE: Emacs configuration file
#+AUTHOR: Filipe Moreira
#+BABEL: :cache yes
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{inconsolata}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+PROPERTY: header-args :tangle yes :cache yes :results silent

* Initial boostrapping 
** Initial setup

This org-mode file when tangle (C-c C-v t) generates two files: `init.el` and `early-init.el`. Any changes here need to be saved and tangle so the respective files are updated.

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE DIRECTLY
;; It is generated from an Org file (init.org).
;;
;; You should make any changes there and regenerate it with C-c C-v t ('org-babel-tangle)
#+end_src

#+begin_src emacs-lisp
  ;; Define variables
  (defvar guto/default-font-size 210)
  (defvar guto/default-variable-font-size 210)

  ;; Make frame transparency overridable
  (defvar guto/frame-transparency '(90 . 90))
#+end_src

* Welcome!

This is an Emacs configuration built with literate programming by using Org mode code 
blocks as the source of the Emacs configuration. Originally based [https://github.com/larstvei/dot-emacs](Lars Tveito's emacs configuration).

Other good resources for literate programming emacs configuration are:

+ [[https://raw.githubusercontent.com/wdenton/.emacs.d][William Denton]]
+ [[https://github.com/sachac/.emacs.d][Sacha Chua]]
+ [[https://github.com/theophilusx/emacs-init-org/][Tim Cross]]
+ [[https://github.com/dieggsy/dotfiles/tree/master/emacs/.emacs.d][Diego]]
+ [[https://github.com/thblt/.emacs.d][Thibault Polge]]
+ [[https://github.com/novoid/dot-emacs][Karl Voit]]
+ [[https://gitlab.com/marcowahl/mw.emacs.d][Marco Wahl]]
+ [[https://github.com/zzamboni/dot-emacs/][Diego Zamboni]]
+ [[https://github.com/tecosaur/emacs-config][tecosaur]]

* Early init

The [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html][early init file]] "is loaded before the package system and GUI is initialized, so in it you can customize variables that affect frame appearance as well as the package initialization process."

These block of babel code have a `:tangle early-init.el` setting and are tangled to `early-init.el`.

#+begin_src emacs-lisp :tangle early-init.el
;; DO NOT EDIT THIS FILE DIRECTLY
;; It is generated from an Org file (init.org).
;;
;; You should make any changes there and regenerate it with C-c C-v t ('org-babel-tangle)
#+end_src

Turn off the mouse interface early in startup to avoid momentary display.

#+begin_src emacs-lisp :tangle early-init.el
(if (fboundp 'menu-bar-mode) (menu-bar-mode 1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
#+end_src

Turn off the startup screen.

#+begin_src emacs-lisp :tangle early-init.el
(setq inhibit-startup-message t)
#+end_src

Go full screen!

#+begin_src emacs-lisp :tangle early-init.el
(when (fboundp 'toggle-frame-maximized)
  (toggle-frame-maximized))
#+end_src

I don't have a "file containing site-wide run-time initializations."

#+begin_src emacs-lisp :tangle early-init.el
(setq site-run-file nil)
#+end_src

And finally, don't garbage clean so often.

#+begin_src emacs-lisp :tangle early-init.el
(setq gc-cons-threshold 8000000) ;; 8 MB
#+end_src

* Functions

#+begin_src emacs-lisp
  (defun is-mac-m1 ()
    "Returns true if the current machine is a M1 Mac"
      (if (cl-search "aarch64-apple" (version))
          t
        nil))
#+end_src

* Package System Setup

Emacs has a built in package manager but it doesn't make it easy to automatically install packages on a new system the first time you pull down your configuration.  [[https://github.com/jwiegley/use-package][use-package]] is a really helpful package used in this configuration to make it a lot easier to automate the installation and configuration of everything else we use.

** Straight.el

#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+end_src

** =use_package= setup

#+begin_src emacs-lisp
    ;; Initialize package sources
    (require 'package)

    ;; using Github based mirros: https://github.com/d12frosted/elpa-mirror
    (setq package-archives
          '(("melpa" . "https://raw.githubusercontent.com/d12frosted/elpa-mirror/master/melpa/")
            ("org"   . "https://raw.githubusercontent.com/d12frosted/elpa-mirror/master/org/")
            ("gnu"   . "https://raw.githubusercontent.com/d12frosted/elpa-mirror/master/gnu/")
            ("melpa-stable"   . "https://raw.githubusercontent.com/d12frosted/elpa-mirror/master/stable-melpa/")
            ))

    ;; (setq package-archives
    ;;       '(("melpa" . "https://melpa.org/packages/")
    ;;         ("org"   . "https://orgmode.org/elpa/")
    ;;         ("elpa"  . "https://elpa.gnu.org/packages/")))

  (setq package-check-signature nil) 

    (package-initialize)

    (unless package-archive-contents
      (package-refresh-contents))

    ;; Initialize use-package on non-Linux platforms
    (unless (package-installed-p 'use-package)
      (straight-use-package 'use-package))

    (require 'use-package)
    (setq use-package-always-ensure t)
    ;; (setq straight-use-package-by-default t) ;; this defaults to using straight.el to install files

    (use-package exec-path-from-shell
      :ensure t
      :if (memq window-system '(mac ns))
      :config
      ;;(setq exec-path-from-shell-arguments '("-l"))
      (exec-path-from-shell-initialize)
      (exec-path-from-shell-copy-env "PATH")
      ;; (exec-path-from-shell-copy-envs
      ;;  '("PATH" "GOPATH" "GO111MODULE" "GOPROXY"
      ;;    "NPMBIN" "LC_ALL" "LANG" "LC_TYPE"
      ;;    "SSH_AGENT_PID" "SSH_AUTH_SOCK" "SHELL"
      ;;    "JAVA_HOME"))
      )
#+end_src

** Automatic Package Updates

The auto-package-update package helps us keep our Emacs packages up to date!  It will prompt you after a certain number of days either at startup or at a specific time of day to remind you to update your packages.

You can also use =M-x auto-package-update-now= to update right now!

#+begin_src emacs-lisp

  (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "09:00"))

#+end_src
* Font Configuration

Currently using IBM Plex Mono and Cantarell.

Good mono fonts:
- Fira Code
- IBM Plex Mono
- Source Code Pro
- JetBrains Mono

Good sans fonts:
- Cantarell
- Source Sans 3 VF

To install the fonts on mac use:

1. `brew tap homebrew/cask-fonts && brew install --cask font-fira-code`
2. `brew install svn`
3. `brew install --cask font-cantarell`

#+begin_src emacs-lisp
    ;; Set the default font face
    (set-face-attribute 'default nil :font "Fira Code" :height guto/default-font-size)
    ;; Set the fixed pitch face
    (set-face-attribute 'fixed-pitch nil :font "Fira Code" :height guto/default-font-size)
    ;; Set the variable pitch face
    (set-face-attribute 'variable-pitch nil :font "Cantarell" :height guto/default-variable-font-size :weight 'regular)

    ;; Enable ligature support
    ;; emacs-mac has native support
    (if (fboundp 'mac-auto-operator-composition-mode)
	(mac-auto-operator-composition-mode))

    ;; For other versions
    (use-package ligature
      :straight (ligature :type git :host github :repo "mickeynp/ligature.el")
      :config
      ;; Enable the "www" ligature in every possible major mode
      (ligature-set-ligatures 't '("www"))
      ;; Enable ligatures in programming modes
      (ligature-set-ligatures 'prog-mode '("www" "**" "***" "**/" "*>" "*/" "\\\\" "\\\\\\" "{-" "::"
					   ":::" ":=" "!!" "!=" "!==" "-}" "----" "-->" "->" "->>"
					   "-<" "-<<" "-~" "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
					   "#_(" ".-" ".=" ".." "..<" "..." "?=" "??" ";;" "/*" "/**"
					   "/=" "/==" "/>" "//" "///" "&&" "||" "||=" "|=" "|>" "^=" "$>"
					   "++" "+++" "+>" "=:=" "==" "===" "==>" "=>" "=>>" "<="
					   "=<<" "=/=" ">-" ">=" ">=>" ">>" ">>-" ">>=" ">>>" "<*"
					   "<*>" "<|" "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->" "<+"
					   "<+>" "<=" "<==" "<=>" "<=<" "<>" "<<" "<<-" "<<=" "<<<"
					   "<~" "<~~" "</" "</>" "~@" "~-" "~>" "~~" "~~>" "%%"))
      ;; Enables ligature checks globally in all buffers. You can also do it
      ;; per mode with `ligature-mode'.
      (global-ligature-mode t))
#+end_src
* General configuration
** Fix for garbled text on yank

source: https://old.reddit.com/r/emacs/comments/93bh4y/new_to_emacs_why_does_my_text_get_rendered/
#+begin_src emacs-lisp
(modify-all-frames-parameters '((inhibit-double-buffering . t)))
#+end_src
* Color Theme
Try out https://github.com/chriskempson/base16

** Emoji support

#+begin_src emacs-lisp
;; Call `emojify-apropos-emoji` or `emojify-insert-emoji`
(use-package emojify
  :hook (after-init . global-emojify-mode))
#+end_src
** Solarized
#+begin_src emacs-lisp :tangle no
  ;; https://protesilaos.com/modus-themes/
  ;;(use-package modus-themes
  ;;  :init (load-theme 'modus-vivendi))

  ;; Solarized theme
  (use-package solarized-theme
    :init (load-theme 'solarized-dark t))

#+end_src
** Dracula
https://draculatheme.com/

#+begin_src emacs-lisp
(use-package dracula-theme
:init (load-theme 'dracula t))
#+end_src

** Nord
https://www.nordtheme.com

#+begin_src emacs-lisp :tangle no
(use-package nord-theme
:init (load-theme 'nord t))
#+end_src

** Modus

https://protesilaos.com/emacs/modus-themes

#+begin_src emacs-lisp :tangle no
(use-package modus-themes
:init (load-theme 'modus-vivendi))
#+end_src

* Startup Performance

#+begin_src emacs-lisp

  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  (defun guto/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                       (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'guto/display-startup-time)

#+end_src

