.config/emacs/init.org
* General configuration

#+begin_src emacs-lisp
  ;; Change all questions prompts to accept y or n
  (fset 'yes-or-no-p 'y-or-n-p)

#+end_src

#+begin_src emacs-lisp
;; Prompt when closing emacs
(defun guto/save-buffers-kill-terminal-prompt ()
  (interactive)
  (if (y-or-n-p "Quit?")
      (save-buffers-kill-terminal)))

(global-set-key (kbd "C-x C-c") 'guto/save-buffers-kill-terminal-prompt)
#+end_src

** Native compilation settings


#+begin_src emacs-lisp
    ;; Disable logging
;; (setq native-comp-async-report-warnings-errors silent)
(setq native-comp-async-report-warnings-errors nil)

#+end_src

* Keep Folders Clean

We use the [[https://github.com/emacscollective/no-littering/blob/master/no-littering.el][no-littering]] package to keep folders where we edit files and the Emacs configuration folder clean!  It knows about a wide variety of variables for built in Emacs features as well as those from community packages so it can be much easier than finding and setting these variables yourself.

#+begin_src emacs-lisp

  ;; NOTE: If you want to move everything out of the ~/.emacs.d folder
  ;; reliably, set `user-emacs-directory` before loading no-littering!
  ;(setq user-emacs-directory "~/.cache/emacs")

  (use-package no-littering)

  ;; no-littering doesn't set this by default so we must place
  ;; auto save files in the same path as it uses for sessions
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+end_src

* Basic UI Configuration

This section configures basic UI settings that remove unneeded elements to make Emacs look a lot more minimal and modern.  If you're just getting started in Emacs, the menu bar might be helpful so you can remove the =(menu-bar-mode -1)= line if you'd like to still see that.

#+begin_src emacs-lisp

  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        ; Give some breathing room
  ;; (menu-bar-mode -1)          ; Disable the menu bar

  (setq-default cursor-type 'bar) ; change cursor type

  ;; Disable visual bell
  (setq visible-bell       nil)
  (setq ring-bell-function #'ignore)

  (column-number-mode)
  (global-display-line-numbers-mode t)

  ;; Set frame transparency
  ;; (set-frame-parameter (selected-frame) 'alpha guto/frame-transparency)
  ;; (add-to-list 'default-frame-alist `(alpha . ,guto/frame-transparency))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

  (defun guto/full-screen ()
    "Set window to full screen."
    (interactive)
    (set-frame-parameter (selected-frame) 'fullscreen 'maximized))

  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

** Matching parens

#+begin_src emacs-lisp
  (setq show-paren-delay 0)      ; how long to wait?
  (show-paren-mode t)            ; turn paren-mode on
  (setq show-paren-style 'mixed) ; alternatives are 'parenthesis' and 'mixed'
#+end_src

* Keybinding Configuration

These are my changes to the default keybidings for emacs.

#+begin_src emacs-lisp

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  (global-set-key (kbd "C-g") 'keyboard-escape-quit)

  (defun guto/eval-and-replace ()
    "Replace the preceding sexp with its value."
    (interactive)
    (backward-kill-sexp)
    (prin1 (eval (read (current-kill 0)))
           (current-buffer)))

  ;; Should be able to eval-and-replace anywhere.
  (global-set-key (kbd "C-c e") 'guto/eval-and-replace)

  ;; Maps Ctrl-z to undo
  (global-set-key (kbd "C-z") 'undo)

  ;; Maps Ctrl-x-m to M-x
  (global-set-key "\C-x\C-m" 'execute-extended-command)
  (global-set-key "\C-c\C-m" 'execute-extended-command)

  ;; Maps Ctrl-c Ctrl-k to kill-region
  (global-set-key "\C-x\C-k" 'kill-region)
  (global-set-key "\C-c\C-k" 'kill-region)

  ;; Maps Ctrl-w to kill backward word or kill region
  (global-set-key "\C-w"
                  (lambda (arg)
                    (interactive "p")
                    (cond ((region-active-p) (kill-region (region-beginning) (region-end)))
                          (t (backward-kill-word arg)))))

  (global-set-key (kbd "C-c /") 'comment-or-uncomment-region)

  ;; Bind UK pound sign to alt/option-3
  (define-key global-map (kbd "s-3") (lambda () (interactive) (insert "£")))


  ;; Window switching. (C-x o goes to the next window)
  ;;(use-package switch-window
  ;;  :config
  ;;  (global-set-key (kbd "C-x o") 'switch-window))

  (use-package ace-window
    :config
    (global-set-key (kbd "M-o") 'ace-window)
    (global-set-key (kbd "C-x o") 'ace-window)
    (global-set-key (kbd "C-c s") 'ace-swap-window))

  ;; Replace region with yank
  (delete-selection-mode t)

  ;; Disable transient mark mode
  ;; Use C-<SPC> C-<SPC> to temporally activate it.
  (setq transient-mark-mode nil)

  ;; Set Meta key as Command and Super key as Option on a Mac
  (setq mac-command-modifier 'meta) 
  (setq mac-option-modifier 'super)
  (setq mac-control-modifier 'control) ; make Control key do Control
  (setq ns-function-modifier 'hyper)  ; make Fn key do Hyper
#+end_src

** Show key bindings on screen
https://github.com/chuntaro/emacs-keypression
#+begin_src emacs-lisp
  (use-package keypression)
#+end_src

* UI Configuration
** Command Log Mode

[[https://github.com/lewang/command-log-mode][command-log-mode]] is useful for displaying a panel showing each key binding you use in a panel on the right side of the frame.  Great for live streams and screencasts!

#+begin_src emacs-lisp

  (use-package command-log-mode
    :commands command-log-mode)

#+end_src

** Better Modeline

[[https://github.com/seagle0128/doom-modeline][doom-modeline]] is a very attractive and rich (yet still minimal) mode line configuration for Emacs.  The default configuration is quite good but you can check out the [[https://github.com/seagle0128/doom-modeline#customize][configuration options]] for more things you can enable or disable.

*NOTE:* The first time you load your configuration on a new machine, you'll need to run `M-x all-the-icons-install-fonts` so that mode line icons display correctly.

#+begin_src emacs-lisp
  ;; Using beta version: https://old.reddit.com/r/emacs/
  (use-package all-the-icons
    :straight (all-the-icons :type git :host github :repo "domtronn/all-the-icons.el" :branch "svg" :files (:defaults "svg"))
    :if (display-graphic-p))

  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom (
             (doom-modeline-height 15)
             (doom-modeline-project-detection 'project)
             (doom-modeline-buffer-file-name 'relative-to-project)
             (doom-modeline-enable-word-count nil)
             (doom-modeline-env-version t)
             (inhibit-compacting-font-caches t)))


#+end_src

** Which Key

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix.  For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp

  (use-package which-key
    :defer 0
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1))

#+end_src

