.config/emacs/init.org
** Helm

#+begin_src emacs-lisp
  (global-unset-key (kbd "C-x c"))

  (use-package helm
    ;; The default "C-x c" is quite close to "C-x C-c", which quits Emacs.
    ;; Changed to "C-c h". Note: We must set "C-c h" globally, because we
    ;; cannot change `helm-command-prefix-key' once `helm-config' is loaded.
    :straight t
    :ensure t
    :demand
    :bind (
           ("C-c h" . helm-command-prefix)
           ("M-x" . helm-M-x)
           ("C-c RET" . helm-M-x)
           ("C-x m" . helm-M-x)
           ("C-x RET" . helm-M-x)
           ("C-x C-m" . helm-M-x)
           ("C-c h o" . helm-occur)
           ("M-y" . helm-show-kill-ring)
           ("C-x C-f" . helm-find-files)
           ("C-x b" . helm-mini)
           ("C-x C-b" . helm-buffers-list)
           ("C-h f" . helm-apropos)
           ("C-h r" . helm-info-emacs)
           ("C-h C-l" . helm-locate-library)
           ("C-c f" . helm-recentf)
           ("C-x d" . helm-find-files)
           ("C-x C-d" . helm-find-files)
           :map helm-map
           ("<tab>" . helm-execute-persistent-action) ; rebind tab to run persistent action
           ("C-i" . helm-execute-persistent-action) ; make TAB works in terminal
           ("C-z" . helm-select-action) ; list actions using C-z
           :map helm-command-map
           ("o" . helm-occur)
           ("g" . helm-do-grep)
           ("C-c w" . helm-wikipedia-suggest)
           ("SPC" . helm-all-mark-rings))
    :init
    (setq helm-input-idle-delay                 0.01
          helm-reuse-last-window-split-state    t
          helm-split-window-inside-p            t
          helm-buffers-fuzzy-matching           t
          helm-move-to-line-cycle-in-source     t
          helm-ff-search-library-in-sexp        t
          helm-ff-file-name-history-use-recentf t)
    ;; :preface (require 'helm-config)
    :config (helm-mode 1))
#+end_src

*** Helm packages

Super useful commands:
=C-c C-e= switch to edit mode (called within a helm popup)
=C-c p s r= - =helm-ag-project-root= (searches whole project for pattern)

#+begin_src emacs-lisp
    (use-package helm-ag
      :after (helm projectile)
      :ensure t
      :config
      (setq helm-ag-base-command "rg --vimgrep --no-heading --smart-case")
      (setq helm-move-to-line-cycle-in-source 'nil)
      (setq helm-ag-success-exit-status '(0 2))
      :bind (:map projectile-command-map ("s r" . helm-ag-project-root)))
#+end_src

** Helpful Help Commands

[[https://github.com/Wilfred/helpful][Helpful]] adds a lot of very helpful (get it?) information to Emacs' =describe-= command buffers.  For example, if you use =describe-function=, you will not only get the documentation about the function, you will also see the source code of the function and where it gets used in other places in the Emacs configuration.  It is very useful for figuring out how things work in Emacs.

#+begin_src emacs-lisp

  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

** Text Scaling

This is an example of using [[https://github.com/abo-abo/hydra][Hydra]] to design a transient key binding for quickly adjusting the scale of the text on screen.  We define a hydra that is bound to =C-s t s= and, once activated, =j= and =k= increase and decrease the text scale.  You can press any other key (or =f= specifically) to exit the transient key map.

#+begin_src emacs-lisp

  ;;(use-package hydra
  ;;  :defer t)

  ;;(defhydra hydra-text-scale (:timeout 4)
  ;;  "scale text"
  ;;  ("j" text-scale-increase "in")
  ;;  ("k" text-scale-decrease "out")
  ;;  ("f" nil "finished" :exit t))

;;  (guto/leader-keys
;;    "ts" '(hydra-text-scale/body :which-key "scale text"))

#+end_src

** Misc

#+begin_src emacs-elisp

(split-window-horizontally)

#+end_src

* Org Mode

[[https://orgmode.org/][Org Mode]] is one of the hallmark features of Emacs.  It is a rich document editor, project planner, task and time tracker, blogging engine, and literate coding utility all wrapped up in one package.

** Intro to org-mode

Sources:
- https://d12frosted.io/posts/2020-06-23-task-management-with-roam-vol1.html
- https://d12frosted.io/posts/2020-06-24-task-management-with-roam-vol2.html
- https://d12frosted.io/posts/2021-01-16-task-management-with-roam-vol5.html

To makes a headline a project tag using =org-set-tags-command= (=C-c C-q=). For example by adding the tag =PROJECT=.

** Better Font Faces

The =guto/org-font-setup= function configures various text faces to tweak the sizes of headings and use variable width fonts in most cases so that it looks more like we're editing a document in =org-mode=.  We switch back to fixed width (monospace) fonts for code blocks and tables so that they display correctly.

#+begin_src emacs-lisp :tangle no

  (defun guto/org-font-setup ()
    ;; Replace list hyphen with dot
    ;; (font-lock-add-keywords 'org-mode
    ;;                        '(("^ *\\([-]\\) "
    ;;                           (0 (prog1 () (compose-region ;; (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Fira Code" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

#+end_src
