.config/emacs/init.org
* Org roam

Some basic commands:

- =org-roam-node-insert= - =(C-c n i)=: creates a node if it does not exist, and inserts a link to the node at point
- =org-roam-node-find= - =(C-c n f)=: creates a node if it does not exist, and visits the node
- =org-roam-capture= - =(C-c n c)=: creates a node if it does not exist, and restores the current window configuration upon completion
- =completion-at-point= - =C-M-i=: completion at point. Type the first few letters from a node name and a buffer pops up with completions
- =C-c C-o= - =org-open-at-point=: opens link at current point
- =C-c n l=: =org-roam-buffer-toggle= - opens up buffer with backlinks to current node

#+begin_src emacs-lisp
  (use-package org-roam
    :straight t
    :ensure t
    :custom
    (org-roam-directory (file-truename "~/sync/notes/org-roam/"))
    (org-roam-completion-everywhere t)
    (org-roam-mode-sections
     (list #'org-roam-backlinks-section
           #'org-roam-reflinks-section
           ;; Unlinked references are slow and not enabled by default
           ;; https://www.orgroam.com/manual.html#Configuring-what-is-displayed-in-the-buffer
           ;; #'org-roam-unlinked-references-section
           ))
    (org-roam-capture-templates
     '(
       ("d" "default" plain
        "%?"
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
        :unnarrowed t)

       ("l" "programming language" plain
        (file "~/.config/emacs/templates/org-roam-language-template.org")
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
        :unnarrowed t)

       ("r" "resource notes" plain
        (file "~/.config/emacs/templates/org-roam-resource-template.org")
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: RESOURCE")
        :unnarrowed t)

       ("e" "recipe" plain
        (file "~/.config/emacs/templates/org-roam-recipe-template.org")
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
        :unnarrowed t)

       ("b" "bible" plain
        (file "~/.config/emacs/templates/org-roam-bible-reference-template.org")
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
        :unnarrowed t)

       ("p" "people" plain
        (file "~/.config/emacs/templates/org-roam-people-template.org")
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: PEOPLE")
        :unnarrowed t)

       ("o" "project" plain
        (file "~/.config/emacs/templates/org-roam-project-template.org")
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: PROJECT")
        :unnarrowed t)

       ("i" "issue" plain
        (file "~/.config/emacs/templates/org-roam-issue-template.org")
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: ISSUE")
        :unnarrowed t)))
    ;; org-roam-dailies
    (org-roam-dailies-directory "~/sync/notes/journal/")
    (org-roam-dailies-capture-templates
     '(("d" "default" entry
        "* %?"
        :target (file+head "%<%Y%m%d>.org"
                           "#+title: %<%Y%m%d>\n#+filetags: JOURNAL"))))

    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n g" . org-roam-graph)
           ("C-c n i" . org-roam-node-insert)
           ("C-c n c" . org-roam-capture)
           ("C-c n j" . org-roam-dailies-capture-today)
           ("C-c n y" . org-roam-dailies-goto-yesterday)
           ("C-c n t" . org-roam-dailies-goto-today)
           :map org-mode-map
           ("C-M-i"   . completion-at-point)
           :map org-roam-dailies-map
           ("Y" . org-roam-dailies-capture-yesterday)
           ("T" . org-roam-dailies-capture-tomorrow))
    :bind-keymap
    ("C-c n d" . org-roam-dailies-map)
    :config
    (require 'org-roam-dailies) ;; Ensure the keymap is available
    ;; If you're using a vertical completion framework, you might want a more informative completion interface
    (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))

    (org-roam-db-autosync-mode)
    ;; If using org-roam-protocol
    (require 'org-roam-protocol))
#+end_src
* Languages
** LSP mode
*** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp
  (use-package lsp-mode
    :ensure t
    :hook (
           (lsp-mode . lsp-enable-which-key-integration)
           (java-mode . lsp-deferred)
           ;; (ruby-mode . lsp-deferred)
           )
    :init (setq 
           lsp-keymap-prefix "C-c l"              ; this is for which-key integration documentation, need to use lsp-mode-map
           lsp-enable-file-watchers nil
           read-process-output-max (* 1024 1024)  ; 1 mb
           lsp-completion-provider :capf
           lsp-idle-delay 0.500
           )
    :config 
    (setq lsp-intelephense-multi-root nil) ; don't scan unnecessary projects
    (with-eval-after-load 'lsp-intelephense
      (setf (lsp--client-multi-root (gethash 'iph lsp-clients)) nil))
    (define-key lsp-mode-map (kbd "C-c l") lsp-command-map))

#+end_src

This is a barebones configuration of LSP

#+begin_src emacs-lisp :tangle no
   ;;; lsp-start-plain.el --- LSP mode quick starter      -*- lexical-binding: t; -*-

  ;; Copyright (C) 2018 Ivan Yonchovski

  ;; Author: Zhu Zihao <all_but_last@163.com>
  ;; Keywords: languages

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; This file is a helper to start a minimal lsp environment.
  ;; To use this, start your Emacs with "emacs -q" and load this file.

  ;; It will install `lsp-mode', `lsp-ui' with their dependencies to start a
  ;; minimal lsp environment.

  ;; And it forces Emacs to load `.el' files rather than `.elc' files
  ;; for more readable backtrace.

  ;;; Code:

  (require 'package)

  (setq debug-on-error t
        no-byte-compile t
        package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("gnu" . "https://elpa.gnu.org/packages/"))
        package-user-dir (expand-file-name (make-temp-name "lsp-tmp-elpa")
                                           user-emacs-directory)
        custom-file (expand-file-name "custom.el" package-user-dir))

  (let* ((pkg-list '(
                     lsp-mode
                     lsp-ui
                     yasnippet
                     lsp-java
                     lsp-python-ms
                     lsp-haskell
                     helm-lsp
                     lsp-treemacs
                     dap-mode
                     lsp-origami
                     lsp-dart
                     company
                     flycheck
                     lsp-pyright
                     ;; modes
                     ruby-mode
                     rust-mode
                     php-mode
                     scala-mode
                     dart-mode
                     clojure-mode)))

    (package-initialize)
    (package-refresh-contents)

    (mapc (lambda (pkg)
            (unless (package-installed-p pkg)
              (package-install pkg))
            (require pkg))
          pkg-list)

    (yas-global-mode)
    (add-hook 'prog-mode-hook 'lsp)
    (add-hook 'kill-emacs-hook `(lambda ()
                                  (delete-directory ,package-user-dir t))))

  (provide 'lsp-start-plain)
  ;;; lsp-start-plain.el ends here
#+end_src

*** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp

  (use-package lsp-ui
    :ensure t
    :after (lsp-mode)
    :bind (:map lsp-ui-mode-map
                ([remap xref-find-definitions] . lsp-ui-peek-find-definitions)
                ([remap xref-find-references] . lsp-ui-peek-find-references))
    :init (setq lsp-ui-doc-delay 1.5
                lsp-ui-doc-position 'bottom
                lsp-ui-doc-max-width 100))

#+end_src

*** helm-lsp

#+begin_src emacs-lisp
  (use-package helm-lsp
    :ensure t
    :after (lsp-mode)
    :commands helm-lsp-workspace-symbol)
#+end_src

*** Treemacs

#+begin_src emacs-lisp
(use-package lsp-treemacs
  :after (lsp-mode treemacs)
  :ensure t
  :commands lsp-treemacs-errors-list
  :bind (:map lsp-mode-map
         ("M-9" . lsp-treemacs-errors-list)))

(use-package treemacs
  :ensure t
  :commands (treemacs)
  :after (lsp-mode))
#+end_src

*** TODO Debugging with dap-mode

[[https://emacs-lsp.github.io/dap-mode/][dap-mode]] is an excellent package for bringing rich debugging capabilities to Emacs via the [[https://microsoft.github.io/debug-adapter-protocol/][Debug Adapter Protocol]].  You should check out the [[https://emacs-lsp.github.io/dap-mode/page/configuration/][configuration docs]] to learn how to configure the debugger for your language.  Also make sure to check out the documentation for the debug adapter to see what configuration parameters are available to use for your debug templates!

#+begin_src emacs-lisp :tangle no
  (use-package dap-mode
    ;;Uncomment the config below if you want all UI panes to be hidden by default!
      :custom
      (lsp-enable-dap-auto-configure nil)
      :config
      (dap-ui-mode 1)
     :commands dap-debug
     :config
     ;; Set up Node debugging
     (require 'dap-node)
     (dap-node-setup) ;; Automatically installs Node debug adapter if needed

     ;; Bind `C-c l d` to `dap-hydra` for easy access
     (general-define-key
       :keymaps 'lsp-mode-map
       :prefix lsp-keymap-prefix
       "d" '(dap-hydra t :wk "debugger")))

#+end_src

*** direnv-mode

