.config/emacs/init.org
*** attrap

#+begin_src emacs-lisp
(use-package attrap
  :ensure t
  :bind (("C-x /" . attrap-attrap))) ;; use any binding of your choice
#+end_src

#+begin_src emacs-lisp
(use-package direnv)
#+end_src

** Electric pair mode

#+begin_src emacs-lisp
  (electric-pair-mode)
#+end_src

** Paredit

#+begin_src emacs-lisp
  (use-package paredit)
#+end_src

** Web mode

#+begin_src emacs-lisp
  ;; C-c C-n - jump between start/end tags
  ;; C-c C-f - fold code block
  ;; C-c C-s - code insertion
  ;; C-c C-m - clever text selection
  ;; C-c C-i - indent entire buffer

  (use-package web-mode
    :ensure t
    :mode (("\\.html?\\'" . web-mode)
           ("\\.[jt]sx?\\'" . web-mode)
           ("\\.[jt]s?\\'" . web-mode)
           ("\\.erb?\\'" . web-mode))
    :config
    (setq web-mode-markup-indent-offset 2
          web-mode-css-indent-offset 2
          web-mode-code-indent-offset 2
          web-mode-block-padding 2
          web-mode-comment-style 2
          web-mode-enable-css-colorization t
          web-mode-enable-auto-pairing t
          web-mode-enable-comment-keywords t
          web-mode-enable-current-element-highlight t)

    (add-hook 'web-mode-hook
              (lambda ()
                (if (or
                     (string-equal "tsx" (file-name-extension buffer-file-name))
                     (string-equal "ts" (file-name-extension buffer-file-name)))
                    (guto/setup-tide-mode)))))
#+end_src

** TypeScript

This is a basic configuration for the TypeScript language so that =.ts= files activate =typescript-mode= when opened.  We're also adding a hook to =typescript-mode-hook= to call =lsp-deferred= so that we activate =lsp-mode= to get LSP features every time we edit TypeScript code.

#+begin_src emacs-lisp
  (defun guto/setup-tide-mode ()
    (interactive)
    (tide-setup)
    (flycheck-mode +1)
    (setq flycheck-check-syntax-automatically '(save mode-enabled))
    (eldoc-mode +1)
    (tide-hl-identifier-mode +1)
    (company-mode +1))

  (defun guto/set-local-eslint ()
    "Use local node_modules."
    (add-node-modules-path)
    (setq-local flycheck-javascript-eslint-executable (executable-find "eslint")))

  (use-package tide
    :ensure 
    :config
    (flycheck-add-next-checker 'tsx-tide 'javascript-eslint)
    :after (web-mode company flycheck)
    :hook (web-mode . guto/setup-tide-mode))

  (use-package typescript-mode
    :ensure t
    :mode (
           ("\\.ts\\'" . typescript-mode)
           ("\\.gql\\'" . typescript-mode))
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2)
    (add-hook 'typescript-mode #'subword-mode)) 

  (use-package flycheck
    :ensure t
    :hook (web-mode . guto/set-local-eslint)
    :init
    (setq flycheck-python-flake8-executable (executable-find "flake8"))
    (setq flycheck-python-pycompile-executable (executable-find "python3"))
    :config
    (flycheck-add-mode 'javascript-eslint 'web-mode)
    (setq flycheck-check-syntax-automatically '(mode-enabled save))
    (global-flycheck-mode 1))

  (use-package add-node-modules-path
    :ensure t)
#+end_src

** JavaScript

Source

#+begin_src emacs-lisp
  ;; source from: https://www.draketo.de/software/emacs-javascript.html
  (use-package js2-mode :ensure t :defer 20
    :mode
    (("\\.js\\'" . js2-mode))
    :custom
    (js2-include-node-externs t)
    (js2-global-externs '("customElements"))
    (js2-highlight-level 3)
    (js2r-prefer-let-over-var t)
    (js2r-prefered-quote-type 2)
    (js-indent-align-list-continuation t)
    (global-auto-highlight-symbol-mode t)
    :config
    (setq js-indent-level 2)
    ;; patch in basic private field support
    (advice-add #'js2-identifier-start-p
              :after-until
              (lambda (c) (eq c ?#))))

  (use-package js2-refactor :ensure t :defer 30
    :config
    (add-hook 'js2-mode-hook #'js2-refactor-mode)
    (js2r-add-keybindings-with-prefix "C-c C-m"))

  ;; context menu for keybindings
  (use-package discover :ensure t :defer 30
    :config
    (global-discover-mode 1))
#+end_src
** Ruby

#+begin_src emacs-lisp :tangle no
  (use-package robe
    :straight (robe :type git :host github :repo "dgutov/robe")
    :hook (ruby-mode)
    :config
  (global-robe-mode))
#+end_src

Rinari is disabled for the moment
#+begin_src emacs-lisp :tangle no
  (use-package rinari
    :hook (ruby-mode))
#+end_src

Inf-ruby is disabled for the moment
#+begin_src emacs-lisp :tangle no
  (use-package inf-ruby
    :hook (ruby-mode))
#+end_src

#+begin_src emacs-lisp
  (use-package ruby-mode
    ;;:after lsp-mode
    :mode
    (("\\(?:\\.rb\\|ru\\|rake\\|thor\\|jbuilder\\|gemspec\\|podspec\\|/\\(?:Gem\\|Rake\\|Cap\\|Thor\\|Vagrant\\|Guard\\|Pod\\|Fast\\|Match\\|App\\)file\\)\\'" . ruby-mode))
    :interpreter "ruby"
    :init (add-hook 'ruby-mode-hook 'flycheck-mode))

  (use-package projectile-rails
  :config
  (projectile-rails-global-mode))

  (use-package ruby-electric
    :after ruby-mode
    :hook (ruby-mode . ruby-electric-mode))

  (use-package ruby-test-mode
    :after ruby-mode
    :diminish ruby-test-mode)
#+end_src

#+begin_src emacs-lisp
  (use-package ruby-tools
   :after ruby-mode
   :hook (ruby-mode . ruby-tools-mode))
#+end_src
*** Ruby-lsp

#+begin_src emacs-lisp :tangle no
  (use-package lsp-mode
    :init
    ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
    (setq lsp-keymap-prefix "C-c l")
    :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
           (ruby-mode . lsp)
           ;; if you want which-key integration
           (lsp-mode . lsp-enable-which-key-integration))
    :commands lsp)

  ;; optionally
  (use-package lsp-ui :commands lsp-ui-mode)
  ;; if you are helm user
  (use-package helm-lsp :commands helm-lsp-workspace-symbol)
  ;; if you are ivy user
  (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
  (use-package lsp-treemacs :commands lsp-treemacs-errors-list)

  ;; optionally if you want to use debugger
  (use-package dap-mode)
  ;; (use-package dap-LANGUAGE) to load the dap adapter for your language

  ;; optional if you want which-key integration
  (use-package which-key
      :config
      (which-key-mode))
#+end_src

** YAML

#+begin_src emacs-lisp
(use-package yaml-mode)
#+end_src
** Rust

#+begin_src emacs-lisp
  ;; (use-package toml-mode)

  ;; (use-package rust-mode
  ;;   :hook (rust-mode . lsp))

  ;; ;; Add keybindings for interacting with Cargo
  ;; (use-package cargo
  ;;   :hook (rust-mode . cargo-minor-mode))

  ;; (use-package flycheck-rust
  ;;   :config (add-hook 'flycheck-mode-hook #'flycheck-rust-setup))

  ;; rust-mode
  ;; https://github.com/rust-lang/rust-mode

  (use-package rust-mode
    :bind ( :map rust-mode-map
                 (("C-c C-t" . racer-describe)
                  ([?\t] .  company-indent-or-complete-common)))
    :config
    (progn
      ;; add flycheck support for rust (reads in cargo stuff)
      ;; https://github.com/flycheck/flycheck-rust
      (use-package flycheck-rust)

      ;; cargo-mode for all the cargo related operations
      ;; https://github.com/kwrooijen/cargo.el
      (use-package cargo
        :hook (rust-mode . cargo-minor-mode)
        :bind
        ("C-c C-c C-n" . cargo-process-new)) ;; global binding

      ;;; separedit ;; via https://github.com/twlz0ne/separedit.el
      (use-package separedit
        :straight (separedit :type git :host github :repo "idcrook/separedit.el")
        :config
        (progn
          (define-key prog-mode-map (kbd "C-c '") #'separedit)
          (setq separedit-default-mode 'markdown-mode)))

      ;;; racer-mode for getting IDE like features for rust-mode
      ;; https://github.com/racer-rust/emacs-racer
      (use-package racer
        :hook (rust-mode . racer-mode)
        :config
        (progn
          ;; package does this by default ;; set racer rust source path environment variable
          (setq racer-rust-src-path (getenv "RUST_SRC_PATH"))
          (defun guto/my-racer-mode-hook ()
            (set (make-local-variable 'company-backends)
                 '((company-capf company-files)))
            (setq company-minimum-prefix-length 1)
            (setq indent-tabs-mode nil))

          (add-hook 'racer-mode-hook 'guto/my-racer-mode-hook)

          ;; enable company and eldoc minor modes in rust-mode (racer-mode)
          (add-hook 'racer-mode-hook #'company-mode)
          (add-hook 'racer-mode-hook #'eldoc-mode)))

      (add-hook 'rust-mode-hook 'flycheck-mode)
      (add-hook 'flycheck-mode-hook 'flycheck-rust-setup)

      ;; format rust buffers on save using rustfmt
      (add-hook 'before-save-hook
                (lambda ()
                  (when (eq major-mode 'rust-mode)
                    (rust-format-buffer))))))
#+end_src
** JSON

#+begin_src emacs-lisp
(use-package json-mode)
#+end_src
** Groovy

#+begin_src emacs-lisp
  (use-package groovy-mode
    :config
    (setq groovy-indent-offset 4))
#+end_src
** Swift

#+begin_src emacs-lisp
(use-package swift-mode)
#+end_src
** Haskell

#+begin_src emacs-lisp
(use-package haskell-mode)
#+end_src

