.config/emacs/init.org
*** Dante

Add a line starting with `-- >>>` and run `dante-eval-block` to evaluate code inside Emacs.

#+begin_src emacs-lisp
  (use-package dante
    :ensure t
    :after haskell-mode
    :commands 'dante-mode
    :init
    (add-hook 'haskell-mode-hook 'flycheck-mode)
    (add-hook 'haskell-mode-hook 'dante-mode))
#+end_src
** Nix

#+begin_src emacs-lisp
  (use-package nix-mode
    :straight (nix-mode :type git :host github :repo "NixOS/nix-mode")
    :mode "\\.nix\\'")
#+end_src
** Java

#+begin_src emacs-lisp :tangle no
  (use-package lsp-java 
  :ensure t
  ;; :config (add-hook 'java-mode-hook 'lsp)
  )

#+end_src
** Golang

#+begin_src emacs-lisp
  (use-package go-mode
    :config (setq tab-width 4)
    )
#+end_src
** Elixir
source: https://medium.com/@victor.nascimento/elixir-development-on-emacs-9f6776265e4d

#+begin_src emacs-lisp
  (use-package elixir-mode
    :ensure t
    :init
    (add-hook 'elixir-mode-hook
              (lambda ()
                (push '(">=" . ?\u2265) prettify-symbols-alist)
                (push '("<=" . ?\u2264) prettify-symbols-alist)
                (push '("!=" . ?\u2260) prettify-symbols-alist)
                (push '("==" . ?\u2A75) prettify-symbols-alist)
                (push '("=~" . ?\u2245) prettify-symbols-alist)
                (push '("<-" . ?\u2190) prettify-symbols-alist)
                (push '("->" . ?\u2192) prettify-symbols-alist)
                (push '("<-" . ?\u2190) prettify-symbols-alist)
                (push '("|>" . ?\u25B7) prettify-symbols-alist))))
#+end_src
*** Reformatter

#+begin_src emacs-lisp
  (use-package reformatter
    :ensure t
    :config
    ; Adds a reformatter configuration called "+elixir-format"
    ; This uses "mix format -"
    (reformatter-define +elixir-format
      :program "mix"
      :args '("format" "-"))
    ; defines a function that looks for the .formatter.exs file used by mix format
    (defun +set-default-directory-to-mix-project-root (original-fun &rest args)
      (if-let* ((mix-project-root (and buffer-file-name
                                       (locate-dominating-file buffer-file-name
                                                               ".formatter.exs"))))
          (let ((default-directory mix-project-root))
            (apply original-fun args))
        (apply original-fun args)))
    ; adds an advice to the generated function +elxir-format-region that sets the proper root dir
    ; mix format needs to be run from the root directory otherwise it wont use the formatter configuration
    (advice-add '+elixir-format-region :around #'+set-default-directory-to-mix-project-root)
    ; Adds a hook to the major-mode that will add the generated function +elixir-format-on-save-mode
    ; So, every time we save an elixir file it will try to find a .formatter.exs and then run mix format from
    ; that file's directory
    (add-hook 'elixir-mode-hook #'+elixir-format-on-save-mode))
#+end_src

** Lua
Lua mode

#+begin_src emacs-lisp
  (use-package lua-mode)
#+end_src
** Terraform

https://github.com/emacsorphanage/terraform-mode

#+begin_src emacs-lisp
  (use-package terraform-mode)
#+end_src

* Tools
** Company Mode

[[http://company-mode.github.io/][Company Mode]] provides a nicer in-buffer completion interface than =completion-at-point= which is more reminiscent of what you would expect from an IDE.  We add a simple configuration to make the keybindings a little more useful (=TAB= now completes the selection and initiates completion at the current location if needed).

We also use [[https://github.com/sebastiencs/company-box][company-box]] to further enhance the look of the completions with icons and better overall presentation.

#+begin_src emacs-lisp

  (use-package company
    :after lsp-mode
    :hook (
           (lsp-mode . company-mode)
           (lsp-mode . ruby-mode)
           (prog-mode . company-mode))
    :bind (:map company-active-map
           ("<tab>" . company-complete-selection))
          (:map lsp-mode-map
           ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 2)
    (company-idle-delay 0.5)
    (company-show-numbers t)
    (company-tooltip-align-annotations t)
    (company-tooltip-flip-when-above t))

  (use-package company-box
    :hook (company-mode . company-box-mode))

  (use-package company-quickhelp
    :ensure t
    :init
    (company-quickhelp-mode 1)
    (use-package pos-tip
      :ensure t))

#+end_src
** Projectile

[[https://projectile.mx/][Projectile]] is a project management library for Emacs which makes it a lot easier to navigate around code projects for various languages.  Many packages integrate with Projectile so it's a good idea to have it installed even if you don't use its commands directly.

Some useful commands:

=C-c p p= - =helm-projectile-switch-project= (opens new project outside the project folder)

| Key binding | Command                                       | Description                                                  |
| =C-c p h=   | =helm-projectile=                             | Helm interface to projectile                                 |
| =C-c p p=   | =helm-projectile-switch-project=              | Switches to another projectile project                       |
| =C-c p f=   | =helm-projectile-find-file=                   | Lists all files in a project                                 |
| =C-c p F=   | =helm-projectile-find-file-in-known-projects= | Find file in all known projects                              |
| =C-c p g =  | =helm-projectile-find-file-dwim=              | Find file based on context at point                          |
| =C-c p d=   | =helm-projectile-find-dir=                    | Lists available directories in current project               |
| =C-c p e=   | =helm-projectile-recentf=                     | Lists recently opened files in current project               |
| =C-c p a=   | =helm-projectile-find-other-file=             | Switch between files with same name but different extensions |
| =C-c p b=   | =helm-projectile-switch-to-buffer=            | List all open buffers in current project                     |
| =C-c p s s= | =helm-projectile-ag=                          | Searches for symbol starting from project root               |

#+begin_src emacs-lisp

  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/projects/")
      (setq projectile-project-search-path '("~/projects/")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))

#+end_src
** Magit

[[https://magit.vc/][Magit]] is the best Git interface I've ever used.  Common Git operations are easy to execute quickly using Magit's command panel system.

#+begin_src emacs-lisp
  (use-package magit
    :straight (magit :type git :host github :repo "magit/magit")
    :commands magit-status
    :bind (("C-c g" . magit-status)
           ("C-x f" . magit-status)
           ("C-x C-g" . magit-status)
           ("C-x g" . magit-status))
    :custom
    (magit-save-repository-buffers nil)
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    (magit-refresh-status-buffer nil)
    (auto-revert-buffer-list-filter 'magit-auto-revert-repository-buffer-p)
    (setq magit-git-executable
          (if (is-mac-m1)
              "/opt/homebrew/bin/git"
            "/usr/local/bin/git"))
    ;; (magit-git-executable "/usr/local/bin/git")
    ;; Disabling certain features: https://jakemccrary.com/blog/2020/11/14/speeding-up-magit/
    (remove-hook 'magit-status-sections-hook 'magit-insert-tags-header)
    (remove-hook 'magit-status-sections-hook 'magit-insert-status-headers)
    (remove-hook 'magit-status-sections-hook 'magit-insert-unpushed-to-pushremote)
    (remove-hook 'magit-status-sections-hook 'magit-insert-unpulled-from-pushremote)
    (remove-hook 'magit-status-sections-hook 'magit-insert-unpulled-from-upstream)
    (remove-hook 'magit-status-sections-hook 'magit-insert-unpushed-to-upstream-or-recent))
#+end_src

*** Forge

  NOTE: Make sure to configure a GitHub token before using this package!
  - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started

#+begin_src emacs-lisp :tangle no
  (use-package forge
   :after magit)
#+end_src

** Rainbow Delimiters

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth.  This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

#+begin_src emacs-lisp

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** Editorconfig

Adding newline character is still broken. Look into how to hook into this and fix it.
#+begin_src emacs-lisp
      ;; (use-package editorconfig
      ;;   :ensure t
      ;;   :config
      ;;   (setq editorconfig-trim-whitespaces-mode
      ;;      'ws-butler-mode)
      ;;   (editorconfig-mode 1))

    ;; trims whitespace only on touched lines

    (use-package ws-butler
      :straight (ws-butler :type git :host github :repo "lewang/ws-butler")
      :ensure t)

  ;; (use-package editorconfig
  ;;   :ensure t
  ;;   :config
  ;;   (editorconfig-mode 1))

    (use-package editorconfig
      :hook (prog-mode . editorconfig-mode)
      :ensure t
      :config
      (defun guto/editorconfig-disable-ws-butler-maybe-h (props)
        "Disable `ws-butler-mode' if trim_trailing_whitespace is true."
        (when (and (equal (gethash 'trim_trailing_whitespace props) "true")
                   (bound-and-true-p ws-butler-mode))
          (ws-butler-mode -1)))
      (add-hook 'editorconfig-after-apply-functions #'guto/editorconfig-disable-ws-butler-maybe-h)
      (editorconfig-mode 1))
#+end_src
** Prettier

*** Apheleia

A few options here. This is the apheleia setup
NOTE: Unstable for the moment

#+begin_src emacs-lisp :tangle no
  (use-package apheleia
   :straight (apheleia :type git :host github :repo "raxod502/apheleia")
   :ensure t
   :config
   (apheleia-global-mode +1))
#+end_src

*** Prettier

This is the `prettier.el` setup (https://github.com/jscheid/prettier.el)

#+begin_src emacs-lisp
  (use-package prettier
    :ensure t
    :hook (js2-mode json-mode))

  (defun guto/enable-minor-mode (my-pair)
      "Enable minor mode if filename match the regexp.  MY-PAIR is a cons cell (regexp . minor-mode)."
      (if (buffer-file-name)
          (if (string-match (car my-pair) buffer-file-name)
              (funcall (cdr my-pair)))))

  (add-hook 'web-mode-hook #'(lambda ()
                               (guto/enable-minor-mode
                                '("\\.jsx?\\'" . prettier-mode))))
  (add-hook 'web-mode-hook #'(lambda ()
                               (guto/enable-minor-mode
                                '("\\.tsx?\\'" . prettier-mode))))
  (add-hook 'json-mode-hook #'(lambda ()
                                (guto/enable-minor-mode
                                 '("\\.json?\\'" . prettier-mode))))
#+end_src

