.config/emacs/init.el

(use-package dante
  :ensure t
  :after haskell-mode
  :commands 'dante-mode
  :init
  (add-hook 'haskell-mode-hook 'flycheck-mode)
  (add-hook 'haskell-mode-hook 'dante-mode))

(use-package nix-mode)

(use-package go-mode
  :config (setq tab-width 4)
  )

(use-package company
  :after lsp-mode
  :hook (
         (lsp-mode . company-mode)
         (lsp-mode . ruby-mode)
         (prog-mode . company-mode))
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 2)
  (company-idle-delay 0.5)
  (company-show-numbers t)
  (company-tooltip-align-annotations t)
  (company-tooltip-flip-when-above t))

(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package company-quickhelp
  :ensure t
  :init
  (company-quickhelp-mode 1)
  (use-package pos-tip
    :ensure t))

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/projects/")
    (setq projectile-project-search-path '("~/projects/")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))

(use-package magit
  :straight t
  ;; :pin melpa-stable
  :commands magit-status
  :bind (("C-c g" . magit-status)
         ("C-x f" . magit-status)
         ("C-x C-g" . magit-status)
         ("C-x g" . magit-status))
  :custom
  (magit-save-repository-buffers nil)
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  (magit-refresh-status-buffer nil)
  (auto-revert-buffer-list-filter 'magit-auto-revert-repository-buffer-p)
  (setq magit-git-executable
        (if (is-mac-m1)
            "/opt/homebrew/bin/git"
          "/usr/local/bin/git"))
  ;; (magit-git-executable "/usr/local/bin/git")
  ;; Disabling certain features: https://jakemccrary.com/blog/2020/11/14/speeding-up-magit/
  (remove-hook 'magit-status-sections-hook 'magit-insert-tags-header)
  (remove-hook 'magit-status-sections-hook 'magit-insert-status-headers)
  (remove-hook 'magit-status-sections-hook 'magit-insert-unpushed-to-pushremote)
  (remove-hook 'magit-status-sections-hook 'magit-insert-unpulled-from-pushremote)
  (remove-hook 'magit-status-sections-hook 'magit-insert-unpulled-from-upstream)
  (remove-hook 'magit-status-sections-hook 'magit-insert-unpushed-to-upstream-or-recent))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

;; (use-package editorconfig
  ;;   :ensure t
  ;;   :config
  ;;   (setq editorconfig-trim-whitespaces-mode
  ;;      'ws-butler-mode)
  ;;   (editorconfig-mode 1))

;; trims whitespace only on touched lines

(use-package ws-butler
  :straight (ws-butler :type git :host github :repo "lewang/ws-butler")
  :ensure t)

(use-package editorconfig
  :hook (prog-mode . editorconfig-mode)
  :config
  (defun guto/editorconfig-disable-ws-butler-maybe-h (props)
    "Disable `ws-butler-mode' if trim_trailing_whitespace is true."
    (when (and (equal (gethash 'trim_trailing_whitespace props) "true")
               (bound-and-true-p ws-butler-mode))
      (ws-butler-mode -1)))
  (add-hook 'editorconfig-after-apply-functions #'guto/editorconfig-disable-ws-butler-maybe-h)
  (editorconfig-mode +1))

(use-package prettier
  :ensure t
  :hook (js2-mode json-mode))

(defun guto/enable-minor-mode (my-pair)
    "Enable minor mode if filename match the regexp.  MY-PAIR is a cons cell (regexp . minor-mode)."
    (if (buffer-file-name)
        (if (string-match (car my-pair) buffer-file-name)
            (funcall (cdr my-pair)))))

(add-hook 'web-mode-hook #'(lambda ()
                             (guto/enable-minor-mode
                              '("\\.jsx?\\'" . prettier-mode))))
(add-hook 'web-mode-hook #'(lambda ()
                             (guto/enable-minor-mode
                              '("\\.tsx?\\'" . prettier-mode))))
(add-hook 'json-mode-hook #'(lambda ()
                              (guto/enable-minor-mode
                               '("\\.json?\\'" . prettier-mode))))
