.config/emacs/init.org
*** Prettier.js
This is the setup using `prettier.js`

#+begin_src emacs-lisp :tangle no
  (defun guto/enable-minor-mode (my-pair)
    "Enable minor mode if filename match the regexp.  MY-PAIR is a cons cell (regexp . minor-mode)."
    (if (buffer-file-name)
        (if (string-match (car my-pair) buffer-file-name)
            (funcall (cdr my-pair)))))

  (use-package prettier-js
    :hook (js2-mode json-mode))

  (add-hook 'web-mode-hook #'(lambda ()
                               (guto/enable-minor-mode
                                '("\\.jsx?\\'" . prettier-js-mode))))
  (add-hook 'web-mode-hook #'(lambda ()
                               (guto/enable-minor-mode
                                '("\\.tsx?\\'" . prettier-js-mode))))
  (add-hook 'json-mode-hook #'(lambda ()
                                (guto/enable-minor-mode
                                 '("\\.json?\\'" . prettier-js-mode))))

#+end_src

** Smartparens

#+begin_src emacs-lisp
  (use-package smartparens
    :ensure t
    :diminish smartparens-mode
    :init
    (bind-key "C-M-f" #'sp-forward-sexp smartparens-mode-map)
    (bind-key "C-M-b" #'sp-backward-sexp smartparens-mode-map)
    (bind-key "C-)" #'sp-forward-slurp-sexp smartparens-mode-map)
    (bind-key "C-(" #'sp-backward-slurp-sexp smartparens-mode-map)
    (bind-key "M-)" #'sp-forward-barf-sexp smartparens-mode-map)
    (bind-key "M-(" #'sp-backward-barf-sexp smartparens-mode-map)
    (bind-key "C-S-s" #'sp-splice-sexp)
    (bind-key "C-M-<backspace>" #'backward-kill-sexp)
    (bind-key "C-M-S-<SPC>" (lambda () (interactive) (mark-sexp -1)))
      :config
    (smartparens-global-mode t)
    ;; (sp-pair "'" nil :actions :rem) ;; disable specific pairs
    (setq sp-highlight-pair-overlay nil))
#+end_src

** PDF tools

#+begin_src emacs-lisp
  (use-package pdf-tools
    :straight (:depth full)
    :config
    (pdf-tools-install :no-query)
    ;; open pdfs scaled to fit page
    (setq-default pdf-view-display-size 'fit-page)
    ;; automatically annotate highlights
    (setq pdf-annot-activate-created-annotations t)
    ;; use normal isearch
    (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward)
    ;; turn off cua so copy works
    (add-hook 'pdf-view-mode-hook (lambda () (cua-mode 0)))
    ;; more fine-grained zooming
    (setq pdf-view-resize-factor 1.1)
    ;; keyboard shortcuts
    (define-key pdf-view-mode-map (kbd "h") 'pdf-annot-add-highlight-markup-annotation)
    (define-key pdf-view-mode-map (kbd "t") 'pdf-annot-add-text-annotation)
    (define-key pdf-view-mode-map (kbd "D") 'pdf-annot-delete))

#+end_src

** Custom functions

#+begin_src emacs-lisp
  (defun guto/copy-buffer-full-file-name ()
    "Copy the full path to the current file in the minibuffer."
    (interactive)
    (let ((file-name ((file-relative-name (buffer-file-name)))))
      (if file-name
          (progn
            (kill-new file-name))
        (error "Buffer not visiting a file"))
      ))

  (defun guto/copy-file-buffer-file-name ()
    "Put the current file name on the clipboard"
    (interactive)
    (let ((filename (if (equal major-mode 'dired-mode)
                        default-directory
                      (file-relative-name (buffer-file-name)))))
      (when filename
        (with-temp-buffer
          (insert filename)
          (clipboard-kill-region (point-min) (point-max)))
        (message filename))))


  (global-set-key (kbd "C-c d") 'guto/copy-file-buffer-file-name)
  (global-set-key (kbd "C-c c") 'guto/copy-buffer-full-file-name)
#+end_src

** Yanisppet

#+begin_src emacs-lisp
;; `yas-describe-tables` show the available snippets for current mode
;; `yas-visit-snippet-file` shows definition for snippet
  (use-package yasnippet
   :config (yas-global-mode 1))
#+end_src

#+begin_src emacs-lisp
(use-package yasnippet-snippets)
#+end_src

** Disable ansimode on compilation

#+begin_src emacs-lisp
  (defun guto/ansi-colorize-buffer ()
    (let ((buffer-read-only nil))
      (ansi-color-apply-on-region (point-min) (point-max))))

  (use-package ansi-color
    :ensure t
    :config
    (add-hook 'compilation-filter-hook 'guto/ansi-colorize-buffer))
#+end_src

** Docker

#+begin_src emacs-lisp
(use-package docker)
#+end_src

** Docker compose

#+begin_src emacs-lisp
(use-package docker-compose-mode)
#+end_src

#+begin_src emacs-lisp
(use-package dockerfile-mode)
#+end_src

** Rest client

source: https://github.com/pashky/restclient.el

#+begin_src emacs-lisp
;; restclient
(use-package restclient)
#+end_src

** Whitespace

Sourced from: https://randomgeekery.org/draft/managing-whitespace-in-emacs/

#+begin_src emacs-lisp
;; whitespace
(defun guto/color-dim (steps)
  (apply 'color-rgb-to-hex
         (car (color-gradient
               (color-name-to-rgb (face-attribute 'default :background))
               (color-name-to-rgb (face-attribute 'default :foreground))
               steps))))

(defun guto/theme-whitespace ()
  "Apply my own face-attribute changes after loading a custom theme"
  (set-face-attribute 'whitespace-indentation nil
                      :background (face-attribute 'error :background)
                      :foreground (face-attribute 'error :foreground))
  (set-face-attribute 'whitespace-tab nil
                      :background (face-attribute 'font-lock-comment-face :background)
                      :foreground (face-attribute 'font-lock-comment-face :foreground))
  (set-face-attribute 'whitespace-space nil
                      :background (face-attribute 'font-lock-comment-face :background)
                      :foreground (guto/color-dim 3)))

(use-package whitespace
  :ensure t
  :preface
  (defun guto/whitespace-mode ()
    (unless (eq major-mode 'org-mode)
      (progn
        (whitespace-mode)
        (guto/theme-whitespace))))
  :custom
  ;; (whitespace-action '(auto-cleanup))
  (whitespace-line-column 120)
  (whitespace-style
   '(face lines trailing empty tabs spaces indentation space-mark tab-mark))
  :hook
  ((prog-mode text-mode) . guto/whitespace-mode))
#+end_src

** Tabs

#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
(setq indent-tabs-mode nil)
#+end_src

** Multiple cursors
Source: https://gitea.polonkai.eu/gergely/my-emacs-d/src/branch/master/configuration.org#multiple-cursors

#+begin_src emacs-lisp
  (defun guto/no-blink-matching-paren ()
    (customize-set-variable 'blink-matching-paren nil))

  (defun guto/blink-matching-paren ()
    (customize-set-variable 'blink-matching-paren t))

  (use-package multiple-cursors
    :init
    (defvar guto/mc-prefix-map (make-sparse-keymap)
      "Prefix keymap for multiple-cursors")
    (define-prefix-command 'guto/mc-prefix-map)
    (define-key global-map (kbd "C-c m") 'guto/mc-prefix-map)
    :hook
    (multiple-cursors-mode-enabled . guto/no-blink-matching-paren)
    (multiple-cursors-mode-disabled . guto/blink-matching-paren)
    :bind
    (:map guto/mc-prefix-map
          ("t" . mc/mark-all-like-this)
          ("m" . mc/mark-all-like-this-dwim)
          ("l" . mc/edit-lines)
          ("e" . mc/edit-ends-of-lines)
          ("a" . mc/edit-beginnings-of-lines)
          ("n" . mc/mark-next-like-this)
          ("p" . mc/mark-previous-like-this)
          ("s" . mc/mark-sgml-tag-pair)
          ("d" . mc/mark-all-like-this-in-defun)
          ("M-<mouse-1>" . mc/add-cursor-on-click)))
#+end_src

*** Incremental search for multiple cursors

#+begin_src emacs-lisp
(use-package phi-search)

(use-package phi-search-mc
  :config
  (phi-search-mc/setup-keys))
#+end_src

*** Some extras

#+begin_src emacs-lisp
(use-package mc-extras
  :demand
  :bind
  (:map mc/keymap
   ("C-c m =" . mc/compare-chars)))
#+end_src

*** Add extra cursors via ace-jump

#+begin_src emacs-lisp
(use-package ace-mc
  :bind
  (:map guto/mc-prefix-map
   ("SPC" . ace-mc-add-multiple-cursors)
   ("C-SPC" . ace-mc-add-single-cursor)))
#+end_src

** Dumb jump

source: https://github.com/jacktasia/dumb-jump

#+begin_src emacs-lisp
  (use-package dumb-jump
    :ensure t
    :init
    (setq xref-backend-functions (remq 'etags--xref-backend xref-backend-functions))
    (add-to-list 'xref-backend-functions #'dumb-jump-xref-activate t)
    (setq dumb-jump-selector 'helm))
#+end_src

* Terminals

** term-mode

=term-mode= is a built-in terminal emulator in Emacs.  Because it is written in Emacs Lisp, you can start using it immediately with very little configuration.  If you are on Linux or macOS, =term-mode= is a great choice to get started because it supports fairly complex terminal applications (=htop=, =vim=, etc) and works pretty reliably.  However, because it is written in Emacs Lisp, it can be slower than other options like =vterm=.  The speed will only be an issue if you regularly run console apps with a lot of output.

One important thing to understand is =line-mode= versus =char-mode=.  =line-mode= enables you to use normal Emacs keybindings while moving around in the terminal buffer while =char-mode= sends most of your keypresses to the underlying terminal.  While using =term-mode=, you will want to be in =char-mode= for any terminal applications that have their own keybindings.  If you're just in your usual shell, =line-mode= is sufficient and feels more integrated with Emacs.

With =evil-collection= installed, you will automatically switch to =char-mode= when you enter Evil's insert mode (press =i=).  You will automatically be switched back to =line-mode= when you enter Evil's normal mode (press =ESC=).

Run a terminal with =M-x term!=

*Useful key bindings:*

- =C-c C-p= / =C-c C-n= - go back and forward in the buffer's prompts (also =[[= and =]]= with evil-mode)
- =C-c C-k= - Enter char-mode
- =C-c C-j= - Return to line-mode
- If you have =evil-collection= installed, =term-mode= will enter char mode when you use Evil's Insert mode

#+begin_src emacs-lisp

  (use-package term
    :commands term
    :config
    (setq explicit-shell-file-name "zsh") ;; Change this to zsh, etc
    ;;(setq explicit-zsh-args '())         ;; Use 'explicit-<shell>-args for shell-specific args

    ;; Match the default Bash shell prompt.  Update this if you have a custom prompt
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

#+end_src

*** Better term-mode colors

The =eterm-256color= package enhances the output of =term-mode= to enable handling of a wider range of color codes so that many popular terminal applications look as you would expect them to.  Keep in mind that this package requires =ncurses= to be installed on your machine so that it has access to the =tic= program.  Most Linux distributions come with this program installed already so you may not have to do anything extra to use it.

#+begin_src emacs-lisp

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))

#+end_src

